io_test/results/run6/fio.log
>>>>>>> Test 2 (10 15 2 0.500000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=35820: Thu Aug 20 20:50:50 2015
  write: io=375000MB, bw=256000KB/s, iops=2000, runt=1500000msec
    slat (usec): min=47, max=1739, avg=111.77, stdev=25.04
    clat (usec): min=0, max=19334, avg=698.02, stdev=2091.33
     lat (usec): min=48, max=19389, avg=810.10, stdev=2072.05
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[ 6816], 95.00th=[ 6944],
     | 99.00th=[ 7072], 99.50th=[ 7136], 99.90th=[ 7200], 99.95th=[ 7328],
     | 99.99th=[11328]
    bw (KB  /s): min=    1, max=2352896, per=100.00%, avg=281005.63, stdev=226191.18
    lat (usec) : 2=49.86%, 4=39.81%, 10=0.26%, 20=0.04%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=9.99%, 20=0.01%
  cpu          : usr=1.83%, sys=25.65%, ctx=2776490, majf=0, minf=3843
  IO depths    : 1=90.0%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=10.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3000002/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=375000MB, aggrb=256000KB/s, minb=256000KB/s, maxb=256000KB/s, mint=1500000msec, maxt=1500000msec

Disk stats (read/write):
  rbd4: ios=0/1831978, merge=0/88552000, ticks=0/202398604, in_queue=202380672, util=91.69%
>>>>>>> Test 3 (10 15 4 0.500000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=34728: Thu Aug 20 22:03:08 2015
  write: io=307200MB, bw=207934KB/s, iops=1624, runt=1512846msec
    slat (usec): min=48, max=42728, avg=363.79, stdev=1436.88
    clat (usec): min=0, max=699756, avg=42066.07, stdev=45705.97
     lat (usec): min=56, max=699949, avg=42430.17, stdev=46036.08
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    2],
     | 30.00th=[ 6880], 40.00th=[ 7840], 50.00th=[32640], 60.00th=[56064],
     | 70.00th=[57088], 80.00th=[72192], 90.00th=[112128], 95.00th=[119296],
     | 99.00th=[173056], 99.50th=[220160], 99.90th=[317440], 99.95th=[342016],
     | 99.99th=[602112]
    bw (KB  /s): min=    0, max=2350592, per=100.00%, avg=268222.32, stdev=268107.02
    lat (usec) : 2=13.57%, 4=15.62%, 10=0.11%, 20=0.01%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=13.28%, 20=0.23%, 50=15.33%
    lat (msec) : 100=28.50%, 250=13.02%, 500=0.28%, 750=0.02%
  cpu          : usr=1.42%, sys=21.33%, ctx=869528, majf=0, minf=15044
  IO depths    : 1=29.3%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=70.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=2457600/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=307200MB, aggrb=207934KB/s, minb=207934KB/s, maxb=207934KB/s, mint=1512846msec, maxt=1512846msec

Disk stats (read/write):
  rbd4: ios=0/1058058, merge=0/66410205, ticks=0/196978560, in_queue=197123560, util=97.32%
>>>>>>> Test 4 (10 15 1 0.500000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=3887: Thu Aug 20 23:03:12 2015
  write: io=375000MB, bw=256000KB/s, iops=2000, runt=1500001msec
    slat (usec): min=46, max=3353, avg=114.75, stdev=20.78
    clat (usec): min=0, max=19379, avg=325.20, stdev=1471.25
     lat (usec): min=48, max=19433, avg=440.27, stdev=1457.99
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    1], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    2], 95.00th=[    3],
     | 99.00th=[ 7072], 99.50th=[ 7136], 99.90th=[ 7200], 99.95th=[ 7264],
     | 99.99th=[ 7840]
    bw (KB  /s): min=    4, max=2351360, per=100.00%, avg=266972.30, stdev=148467.11
    lat (usec) : 2=57.19%, 4=37.86%, 10=0.26%, 20=0.04%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=4.62%, 20=0.01%
  cpu          : usr=1.80%, sys=25.98%, ctx=2921800, majf=0, minf=3342
  IO depths    : 1=95.4%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=4.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3000003/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=375000MB, aggrb=256000KB/s, minb=256000KB/s, maxb=256000KB/s, mint=1500001msec, maxt=1500001msec

Disk stats (read/write):
  rbd4: ios=0/2214641, merge=0/91338192, ticks=0/173641460, in_queue=173636284, util=83.46%